In [1]:
import numpy as np 
import pandas as pd

In [8]:
#tratando dados ausentes

dic = {'A':[1,2,3],'B':[6,np.nan,np.nan],'C':[10,11,30]}
dic

{'A': [1, 2, 3], 'B': [6, nan, nan], 'C': [10, 11, 30]}

In [11]:
df = pd.DataFrame(dic)
df

   A    B   C
0  1  6.0  10
1  2  NaN  11
2  3  NaN  30

In [14]:
# utilizando o dropna para eliminar valores Nan
df.dropna()

   A    B   C
0  1  6.0  10

In [21]:
df.dropna(axis=1,thresh = 2)

   A   C
0  1  10
1  2  11
2  3  30

In [28]:
# utilizando fillna

df.fillna(value ='substituindo')

   A             B   C
0  1             6  10
1  2  substituindo  11
2  3  substituindo  30

In [26]:
# preenchendo com dados anteriores

df.fillna(method='ffill')

   A    B   C
0  1  6.0  10
1  2  6.0  11
2  3  6.0  30